# ComboBoxCurrentChangedEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxCurrentChangedEventArgs Members
ComboBoxCurrentChangedEventArgs Class Methods Properties See Also
---
The ComboBoxCurrentChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Application | The current UIApplication.  (Inherited from RibbonItemEventArgs.) |
| NewValue | The current item for the ComboBox after the change. |
| OldValue | The current item for the ComboBox before the change. |

# See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace